In [1]:
import pandas as pd

In [2]:
import warnings 
warnings.filterwarnings('ignore')

## Apply()

In [15]:
data={
    "Name":["Aman","Bob","Charlie","David"],
    "Department":["HR","IT","Finance","IT"],
    "Salary":[50000,60000,55000,70000],
    "Joining_Year":[2019,2020,2018,2021]
}
df=pd.DataFrame(data)
df

      Name Department  Salary  Joining_Year
0     Aman         HR   50000          2019
1      Bob         IT   60000          2020
2  Charlie    Finance   55000          2018
3    David         IT   70000          2021

In [4]:
Salaries=[1000,2000,3000]
updated=list(map(lambda x:x+500,Salaries))
print(updated)

[1500, 2500, 3500]

In [16]:
df["Updated_salaries"]=df["Salary"].apply(lambda x:x+5000)
df

      Name Department  Salary  Joining_Year  Updated_salaries
0     Aman         HR   50000          2019             55000
1      Bob         IT   60000          2020             65000
2  Charlie    Finance   55000          2018             60000
3    David         IT   70000          2021             75000

In [17]:
def salary_category(Salary):
    if Salary>60000:
        return "High"
    else:
        return "low"
df["Salary_category"]=df["Salary"].apply(salary_category)
df

      Name Department  Salary  Joining_Year  Updated_salaries Salary_category
0     Aman         HR   50000          2019             55000             low
1      Bob         IT   60000          2020             65000             low
2  Charlie    Finance   55000          2018             60000             low
3    David         IT   70000          2021             75000            High

In [18]:
import datetime

current_year=datetime.datetime.now().year
df["Experience"]=df.apply(lambda row : current_year - row["Joining_Year"],axis=1)
df

,Name,Department,Salary,Joining_Year,Updated_salaries,Salary_category,Experience
0,Aman,HR,50000,2019,55000,low,7
1,Bob,IT,60000,2020,65000,low,6
2,Charlie,Finance,55000,2018,60000,low,8
3,David,IT,70000,2021,75000,High,5

In [20]:
df["Name_upper"]=df["Name"].apply(str.upper)
df

,Name,Department,Salary,Joining_Year,Updated_salaries,Salary_category,Experience,Name_upper
0,Aman,HR,50000,2019,55000,low,7,AMAN
1,Bob,IT,60000,2020,65000,low,6,BOB
2,Charlie,Finance,55000,2018,60000,low,8,CHARLIE
3,David,IT,70000,2021,75000,High,5,DAVID

In [23]:
df["Dept_len"]=df["Department"].apply(len)
df

,Name,Department,Salary,Joining_Year,Updated_salaries,Salary_category,Experience,Name_upper,Dpt_len,Dept_len
0,Aman,HR,50000,2019,55000,low,7,AMAN,2,2
1,Bob,IT,60000,2020,65000,low,6,BOB,2,2
2,Charlie,Finance,55000,2018,60000,low,8,CHARLIE,7,7
3,David,IT,70000,2021,75000,High,5,DAVID,2,2

In [30]:
def added_salary(Salary):
    Salary+=60000
    return Salary
df["Updated_salaries"]=df["Salary"].apply(added_salary)
df

,Name,Department,Salary,Joining_Year,Updated_salaries,Salary_category,Experience,Name_upper,Dpt_len,Dept_len
0,Aman,HR,50000,2019,110000,low,7,AMAN,2,2
1,Bob,IT,60000,2020,120000,low,6,BOB,2,2
2,Charlie,Finance,55000,2018,115000,low,8,CHARLIE,7,7
3,David,IT,70000,2021,130000,High,5,DAVID,2,2

## Map()

In [32]:
df["updated_salary"]df["Salary"].map(lambda x:x+5000)
df

0    55000
1    65000
2    60000
3    75000
Name: Salary, dtype: int64

In [3]:
import pandas as pd

In [11]:
import warnings 
warnings.filterwarnings('ignore')

In [4]:
data={
    "Name":["Aman","Bob","Charlie","David"],
    "Department":["HR","IT","Finance","IT"],
    "Salary":[50000,60000,55000,70000],
    "Joining_Year":[2019,2020,2018,2021]
}
df=pd.DataFrame(data)
df

      Name Department  Salary  Joining_Year
0     Aman         HR   50000          2019
1      Bob         IT   60000          2020
2  Charlie    Finance   55000          2018
3    David         IT   70000          2021

In [5]:
# map department names to codes
dept_map={"HR":"D1","IT":"D2","Financ":"D3"}
df["Dept_code"]=df["Department"].map(dept_map)
df

      Name Department  Salary  Joining_Year Dept_code
0     Aman         HR   50000          2019        D1
1      Bob         IT   60000          2020        D2
2  Charlie    Finance   55000          2018       NaN
3    David         IT   70000          2021        D2

In [6]:
bonus=pd.Series([500,600,550,700],index=[0,1,2,3])
df["Bonus"]=df.index.map(bonus)
df

      Name Department  Salary  Joining_Year Dept_code  Bonus
0     Aman         HR   50000          2019        D1    500
1      Bob         IT   60000          2020        D2    600
2  Charlie    Finance   55000          2018       NaN    550
3    David         IT   70000          2021        D2    700

In [7]:
df["Name_upper"]=df["Name"].map(str.upper)
df

      Name Department  Salary  Joining_Year Dept_code  Bonus Name_upper
0     Aman         HR   50000          2019        D1    500       AMAN
1      Bob         IT   60000          2020        D2    600        BOB
2  Charlie    Finance   55000          2018       NaN    550    CHARLIE
3    David         IT   70000          2021        D2    700      DAVID

In [8]:
data={
    "Salary":[50000,60000,55000,70000],
    "Numbers":[2019,2020,2018,2021]
}
df=pd.DataFrame(data)
df

   Salary  Numbers
0   50000     2019
1   60000     2020
2   55000     2018
3   70000     2021

In [ ]:
df["Salary"].map(lambda

## applymap()

In [9]:
data={
    "Name":["Aman","Bob","Charlie","David"],
    "Department":["HR","IT","Finance","IT"],
    "Salary":[50000,60000,55000,70000],
    "Bouns":[5000,6000,5500,6000]
}
df=pd.DataFrame(data)
df

      Name Department  Salary  Bouns
0     Aman         HR   50000   5000
1      Bob         IT   60000   6000
2  Charlie    Finance   55000   5500
3    David         IT   70000   6000

In [13]:
def add_numeric(x):
    if isinstance(x,(int,float)):
        return x + 1000
    return x
df2=df.applymap(add_numeric)
df2

      Name Department  Salary  Bouns
0     Aman         HR   51000   6000
1      Bob         IT   61000   7000
2  Charlie    Finance   56000   6500
3    David         IT   71000   7000

In [14]:
def str_update(x):
    if isinstance(x,str):
        return x.upper()
    return x
df3=df.applymap(str_update)
df3

      Name Department  Salary  Bouns
0     AMAN         HR   50000   5000
1      BOB         IT   60000   6000
2  CHARLIE    FINANCE   55000   5500
3    DAVID         IT   70000   6000

In [16]:
def numeric(x):
    if isinstance(x,(int,float)):
        if x>60000:
            return "High"
    return x
df4=df.applymap(numeric)
df4

      Name Department Salary  Bouns
0     Aman         HR  50000   5000
1      Bob         IT  60000   6000
2  Charlie    Finance  55000   5500
3    David         IT   High   6000

## Window Functions

### Rolling() And Expanding()

In [17]:
sales=pd.Series([10,20,30,40,50])
sales

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [19]:
print("Rolling:\n",sales.rolling(3).mean())

Rolling:
 0     NaN
1     NaN
2    20.0
3    30.0
4    40.0
dtype: float64

In [20]:
print("Expanding:\n",sales.expanding().mean())

Expanding:
 0    10.0
1    15.0
2    20.0
3    25.0
4    30.0
dtype: float64

In [21]:
import json

In [23]:
employee_data=[
    {"EmployeeID":1,"Name":"John","Department":"HR","Salary":50000},
    {"EmployeeID":2,"Name":"Ram","Department":"Finance","Salary":60000},
    {"EmployeeID":3,"Name":"David","Department":"IT","Salary":55000}
]

In [25]:
# save data to jason
with open("Employees.json","w")as f:
    json.dump(employee_data,f,indent=4)

In [26]:
with open("Employees.json","r")as f:
    loaded_data=json.load(f)

In [27]:
loaded_data

[{'EmployeeID': 1, 'Name': 'John', 'Department': 'HR', 'Salary': 50000},
 {'EmployeeID': 2, 'Name': 'Ram', 'Department': 'Finance', 'Salary': 60000},
 {'EmployeeID': 3, 'Name': 'David', 'Department': 'IT', 'Salary': 55000}]

In [28]:
df=pd.read_json("employees.json")
df

   EmployeeID   Name Department  Salary
0           1   John         HR   50000
1           2    Ram    Finance   60000
2           3  David         IT   55000

In [29]:
# convert dataframe to jason
df.to_json("emp_output.json",orient="records",indent=4)

In [30]:
json_string='{"EmployeeID":2,"Name":"Ram","Department":"Finance","Salary":60000}'
parsed=json.loads(json_string)
print(parsed)
print(type(parsed))

{'EmployeeID': 2, 'Name': 'Ram', 'Department': 'Finance', 'Salary': 60000}
<class 'dict'>